name: "MODEL_NAME"
<deploy>
input: "data_blob"
input_shape {
  dim: 1
  dim: 61
  dim: 1
  dim: 1
}
</deploy>

<train>
layer {
  name: "data_layer"
  type: "Data"
  top: "data_blob"
  top: "label_blob"
  data_param {
    source: "TRAIN_LMDB"
    batch_size: 20000
    backend: LMDB
    prefetch: 16
  }
<crossval>
  include: { phase: TRAIN }
</crossval>
}

<crossval>
layer {
  name: "data_layer"
  type: "Data"
  top: "data_blob"
  top: "label_blob"
  data_param {
    source: "TEST_LMDB"
    batch_size: 200
    backend: LMDB
    prefetch: 8
  }
  include: { phase: TEST }
}
</crossval>
</train>

layer {
  name: "hidden_sum_layer"
  type: "InnerProduct"
  bottom: "data_blob"
  top: "hidden_sum_blob"

  inner_product_param {
    num_output: 20
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "hidden_act_layer"
  type: "Sigmoid"
  bottom: "hidden_sum_blob"
  top: "hidden_act_blob"
}

layer {
  name: "output_sum_layer"
  type: "InnerProduct"
  bottom: "hidden_act_blob"
  top: "output_sum_blob"

  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "output_act_layer"
  type: "Sigmoid"
  bottom: "output_sum_blob"
  top: "output_act_blob"
}

<train>
layer {
  name: "softmax_layer"
  type: "Softmax"
  bottom: "output_act_blob"
  top: "softmax_blob"
}
layer {
  name: "error_layer"
  type: "InfogainLoss"
  bottom: "softmax_blob"
  bottom: "label_blob"
  top: "error_blob"
  infogain_loss_param {
    source: "WEIGHT_MATRIX"
  }
}
</train>